Update TECHNICAL_DOCUMENTATION.md
